w6d4/firstroutes_and_controllers/app/controllers/users_controller.rb

    def index
        @users = User.all.select(:id, :name, :email)
---
SELECT "users"."id", "users"."name", "users"."email" FROM "users"

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "john"], ["email", "jemail"]]